-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 30, 2024 at 03:22 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pokdeng`
--

-- --------------------------------------------------------

--
-- Table structure for table `adminlog`
--

CREATE TABLE `adminlog` (
  `ID` varchar(50) NOT NULL,
  `Action` varchar(20) NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `N` int(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `adminlog`
--

INSERT INTO `adminlog` (`ID`, `Action`, `time`, `N`) VALUES
('U4bd3cf5bc00ad2e4401a84da2e7e30a9', 'แก้ไขcredit', '2024-08-24 05:46:51', 3),
('U53545d949f8b006c6841be23f55764e0', 'แก้ไขcredit', '2024-08-24 05:48:36', 4),
('U53545d949f8b006c6841be23f55764e0', 'แก้ไขcredit:19.00999', '2024-08-24 05:54:20', 5),
('U53545d949f8b006c6841be23f55764e0', 'แก้ไขcredit:-920', '2024-08-24 05:54:38', 6),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:1', '2024-08-24 05:57:00', 7),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:209', '2024-08-24 16:46:15', 8),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:-453591', '2024-08-26 16:01:16', 9),
('', 'แก้ไขcredit:-1009999', '2024-08-27 11:31:58', 10),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:40395', '2024-08-27 11:31:58', 11),
('U8aa0f0c0848fbbb2a3d1cd77adc4412c', 'แก้ไขcredit:1000000', '2024-08-27 11:32:06', 12),
('', 'แก้ไขcredit:1000000', '2024-08-27 12:42:44', 13),
('', 'แก้ไขcredit:1000000', '2024-08-27 12:42:55', 14),
('', 'แก้ไขcredit:100000', '2024-08-27 12:43:49', 15),
('', 'แก้ไขcredit:100000', '2024-08-27 12:43:57', 16),
('', 'แก้ไขcredit:100000', '2024-08-27 12:44:14', 17),
('', 'แก้ไขcredit:100000', '2024-08-27 12:44:57', 18),
('', 'แก้ไขcredit:100000', '2024-08-27 12:45:13', 19),
('', 'แก้ไขcredit:1000001', '2024-08-27 12:47:09', 20),
('10000', 'แก้ไขcredit:100000', '2024-08-27 12:52:34', 21),
('10000', 'แก้ไขcredit:100000', '2024-08-27 12:52:50', 22),
('10000', 'แก้ไขcredit:100000', '2024-08-27 12:54:18', 23),
('admin', 'แก้ไขcredit:1000', '2024-08-27 12:54:24', 24),
('admin2', 'แก้ไขcredit:1000', '2024-08-27 12:54:33', 25),
('10000', 'แก้ไขcredit:100000', '2024-08-27 12:54:40', 26),
('U4bd3cf5bc00ad2e4401a84da2e7e30a9', 'แก้ไขcredit:1000', '2024-08-27 12:55:20', 27),
('U4bd3cf5bc00ad2e4401a84da2e7e30a9', 'แก้ไขcredit:1000', '2024-08-27 12:55:29', 28),
('10000', 'แก้ไขcredit:100000', '2024-08-27 12:56:14', 29),
('10000', 'แก้ไขcredit:100000', '2024-08-27 12:56:29', 30),
('admin', 'แก้ไขcredit:1000', '2024-08-27 12:56:31', 31),
('U4bd3cf5bc00ad2e4401a84da2e7e30a9', 'แก้ไขcredit:1000', '2024-08-27 12:56:37', 32),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:-39395', '2024-08-27 13:02:23', 33),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:-30395', '2024-08-27 13:04:07', 34),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:-30395', '2024-08-27 13:04:16', 35),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:-30395', '2024-08-27 13:05:09', 36),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:-30395', '2024-08-27 13:05:17', 37),
('10000', 'แก้ไข credit: 0', '2024-08-27 08:25:11', 38),
('10000', 'แก้ไข credit: 0', '2024-08-27 08:25:34', 39),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:27:30', 40),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 10000', '2024-08-27 08:29:22', 41),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:30:24', 42),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 1000', '2024-08-27 08:35:24', 43),
('admin', 'แก้ไข credit: 0', '2024-08-27 08:38:25', 44),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:38:32', 45),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:38:37', 46),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:39:01', 47),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:39:45', 48),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:39:53', 49),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: ', '2024-08-27 08:49:48', 50),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:50:32', 51),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:52:07', 52),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:52:25', 53),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:52:29', 54),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:52:50', 55),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:52:57', 56),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:53:37', 57),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:57:03', 58),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไข credit: 0', '2024-08-27 08:57:10', 59),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:9900', '2024-08-27 14:00:53', 60),
('admin', 'แก้ไขcredit:9000', '2024-08-27 14:03:37', 61),
('U8aa0f0c0848fbbb2a3d1cd77adc4412c', 'แก้ไขcredit:499000', '2024-08-27 14:05:40', 62),
('admin', 'แก้ไขcredit:90000', '2024-08-27 14:06:54', 63),
('admin2', 'แก้ไขcredit:900000', '2024-08-27 14:07:04', 64),
('admin', 'แก้ไขcredit:9900000', '2024-08-27 14:07:12', 65),
('admin', 'แก้ไขcredit:-9990000', '2024-08-27 14:07:34', 66),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:90000', '2024-08-27 14:14:24', 67),
('10000', 'แก้ไขcredit:100000', '2024-08-27 14:17:55', 68),
('10000', 'แก้ไขcredit:100000', '2024-08-27 14:18:01', 69),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:1000000', '2024-08-27 14:19:59', 70),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:1000000', '2024-08-27 14:20:13', 71),
('10000', 'แก้ไขcredit:100000', '2024-08-27 14:22:12', 72),
('10000', 'แก้ไขcredit:100000', '2024-08-27 14:22:25', 73),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:1000000', '2024-08-27 14:22:46', 74),
('U8aa0f0c0848fbbb2a3d1cd77adc4412c', 'แก้ไขcredit:500000', '2024-08-27 14:23:46', 75),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:1000000', '2024-08-27 14:25:12', 76),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:1000000', '2024-08-27 14:25:21', 77),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:1000000', '2024-08-27 14:26:49', 78),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:0', '2024-08-27 14:32:03', 79),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:0', '2024-08-27 14:32:32', 80),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:9000010', '2024-08-27 14:32:40', 81),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:10000000', '2024-08-27 14:32:46', 82),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:0', '2024-08-27 14:32:54', 83),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:0', '2024-08-27 14:33:01', 84),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:-1099000', '2024-08-27 14:33:09', 85),
('admin', 'แก้ไขcredit:990000', '2024-08-27 14:33:22', 86),
('U8aa0f0c0848fbbb2a3d1cd77adc4412c', 'แก้ไขcredit:-400000', '2024-08-27 14:33:29', 87),
('admin2', 'แก้ไขcredit:-1000000', '2024-08-27 14:33:38', 88),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:899990', '2024-08-27 14:35:38', 89),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:0', '2024-08-27 14:35:45', 90),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:0', '2024-08-27 14:36:05', 91),
('U8aa0f0c0848fbbb2a3d1cd77adc4412c', 'แก้ไขcredit:0', '2024-08-27 14:40:50', 92),
('Ue4234ef62c1283d8e1459a8273669d47', 'แก้ไขcredit:0', '2024-08-27 14:40:57', 93),
('U8aa0f0c0848fbbb2a3d1cd77adc4412c', 'แก้ไขcredit:0', '2024-08-28 04:52:03', 94);

-- --------------------------------------------------------

--
-- Table structure for table `playinglog`
--

CREATE TABLE `playinglog` (
  `ID` varchar(50) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Game_play` varchar(50) NOT NULL,
  `round` int(10) NOT NULL,
  `Status` varchar(10) NOT NULL,
  `b1` int(11) NOT NULL,
  `b2` int(11) NOT NULL,
  `b3` int(11) NOT NULL,
  `b4` int(11) NOT NULL,
  `b5` int(11) NOT NULL,
  `b6` int(11) NOT NULL,
  `j1` int(12) NOT NULL,
  `j2` int(12) NOT NULL,
  `j3` int(12) NOT NULL,
  `j4` int(11) NOT NULL,
  `j5` int(11) NOT NULL,
  `j6` int(11) NOT NULL,
  `advanced_pay` int(11) NOT NULL,
  `balance` int(11) NOT NULL,
  `SUM` varchar(50) NOT NULL,
  `Time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `playinglog`
--

INSERT INTO `playinglog` (`ID`, `Name`, `Game_play`, `round`, `Status`, `b1`, `b2`, `b3`, `b4`, `b5`, `b6`, `j1`, `j2`, `j3`, `j4`, `j5`, `j6`, `advanced_pay`, `balance`, `SUM`, `Time`) VALUES
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 47, '0', 0, 0, 0, 100, 0, 0, 0, 0, 0, 0, 0, 0, 500, 0, '', '2024-08-22 11:47:04'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 48, '0', 500, 0, 0, 100, 50, 50, 0, 0, 0, 0, 0, 0, 1500, 0, '', '2024-08-22 11:47:59'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 49, '0', 0, 0, 0, 100, 0, 0, 0, 0, 0, 0, 0, 0, 500, 0, '', '2024-08-22 11:49:15'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 51, '0', 0, 0, 0, 100, 300, 0, 0, 0, 0, 0, 0, 0, 2000, 0, '', '2024-08-22 11:50:16'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 53, '0', 0, 0, 0, 50, 5, 0, 0, 0, 0, 0, 0, 0, 275, 0, '', '2024-08-22 11:52:15'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 55, '0', 0, 0, 0, 105, 6, 0, 0, 0, 0, 0, 0, 0, 555, 0, '', '2024-08-22 11:55:04'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 57, '0', 500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 500, 0, '', '2024-08-22 11:57:21'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 58, '0', 0, 0, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 250, 0, '', '2024-08-22 11:59:22'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 60, '0', 50, 50, 50, 150, 50, 0, 0, 0, 0, 0, 0, 0, 1150, 0, '', '2024-08-22 12:03:25'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 61, '0', 50, 0, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 350, 0, '', '2024-08-22 12:38:19'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 62, '0', 400, 0, 0, 0, 50, 0, 0, 0, 0, 0, 0, 0, 650, 0, '', '2024-08-22 12:39:32'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 63, '0', 500, 0, 0, 0, 66, 0, 0, 0, 0, 0, 0, 0, 830, 0, '', '2024-08-22 13:43:35'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 64, '0', 0, 0, 0, 0, 50, 0, 0, 0, 0, 0, 0, 0, 250, 0, '', '2024-08-22 14:15:36'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 65, '0', 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 10, 0, '', '2024-08-22 15:18:52'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 66, '0', 600, 0, 900, 700, 100, 0, 0, 0, 0, 0, 0, 0, 5500, 0, '', '2024-08-22 16:07:05'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 67, '0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100, 0, '', '2024-08-22 16:20:23'),
('U4bd3cf5bc00ad2e4401a84da2e7e30a9', 'Name', 'END', 68, '0', 1000, 2000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3000, 0, '', '2024-08-23 05:36:57'),
('U4bd3cf5bc00ad2e4401a84da2e7e30a9', 'Name', 'END', 69, '0', 0, 30000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30000, 0, '', '2024-08-23 05:37:58'),
('Ue4234ef62c1283d8e1459a8273669d47', 'Name', 'END', 70, '0', 500, 0, 0, 0, 1000, 0, 0, 0, 0, 0, 0, 0, 5500, 0, '', '2024-08-23 05:41:33'),
('U4bd3cf5bc00ad2e4401a84da2e7e30a9', 'Name', 'END', 70, '0', 21000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21000, 0, '', '2024-08-23 05:41:33'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 71, '0', 0, 0, 0, 0, 0, 0, 0, 500, 0, 0, 600, 0, 3500, 0, '', '2024-08-23 07:40:20'),
('Ue4234ef62c1283d8e1459a8273669d47', 'JamesJR', '', 100, '1', 0, 0, 0, 0, 0, 0, 500, 500, 0, 0, 100, 0, 1500, 0, '', '2024-08-23 07:32:52'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 72, '0', 100, 0, 0, 100, 0, 0, 600, 700, 700, 0, 100, 0, 3100, 0, '', '2024-08-24 07:25:33'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 73, '0', 0, 0, 0, 0, 0, 0, 500, 0, 0, 0, 0, 0, 500, 0, '', '2024-08-24 07:28:36'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 74, '0', 0, 1000, 0, 0, 0, 0, 0, 500, 0, 0, 100, 0, 2000, 0, '', '2024-08-24 07:29:38'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 75, '0', 500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 500, 0, '', '2024-08-24 16:48:29'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 1, '0', 500, 0, 0, 0, 0, 0, 1000, 500, 0, 0, 0, 0, 4000, 0, '', '2024-08-25 06:53:56'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 2, '0', 500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1000, 0, '', '2024-08-25 06:57:01'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 3, '0', 0, 0, 0, 0, 0, 0, 500, 100, 0, 0, 0, 0, 1200, 0, '', '2024-08-25 06:58:10'),
('James JR', 'James JR', 'END', 4, '0', 0, 0, 0, 0, 0, 0, 0, 500, 0, 0, 0, 0, 1000, 0, '', '2024-08-25 07:04:01'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 4, '0', 0, 500, 1000, 0, 0, 0, 500, 500, 0, 0, 0, 0, 5000, 0, '', '2024-08-25 07:04:01'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 5, '0', 600, 0, 0, 0, 0, 0, 700, 0, 0, 0, 0, 0, 2600, 0, '', '2024-08-25 07:11:24'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 6, '0', 500, 0, 0, 0, 0, 0, 1000, 0, 0, 0, 0, 0, 3000, 0, '', '2024-08-25 07:12:53'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 7, '0', 500, 500, 500, 500, 0, 0, 0, 1000, 500, 1000, 0, 0, 9000, 0, '', '2024-08-25 07:14:44'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 8, '0', 0, 700, 600, 0, 0, 0, 0, 500, 0, 0, 500, 0, 4600, 0, '', '2024-08-25 08:25:38'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 9, '0', 0, 0, 600, 410, 0, 0, 0, 500, 0, 0, 500, 0, 4020, 0, '', '2024-08-25 08:29:31'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 10, '0', 0, 0, 600, 0, 0, 0, 0, 500, 0, 0, 500, 0, 3200, 0, '', '2024-08-25 08:30:25'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 11, '0', 0, 0, 600, 500, 500, 0, 0, 500, 0, 0, 500, 0, 5200, 0, '', '2024-08-25 08:33:31'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 12, '0', 500, 0, 600, 0, 0, 0, 0, 1000, 0, 0, 500, 0, 5200, 0, '', '2024-08-25 08:35:06'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 13, '0', 0, 0, 3000, 0, 0, 0, 200, 2500, 0, 0, 2500, 0, 16400, 0, '', '2024-08-25 09:33:46'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 16, '0', 500, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1000, 0, '', '2024-08-25 09:36:35'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 22, '0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 200, 0, '', '2024-08-25 13:32:42'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 23, '0', 0, 9999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19998, 0, '', '2024-08-26 16:09:06'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 24, '0', 9999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19998, 0, '', '2024-08-26 16:09:50'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 25, '0', 9999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19998, 0, '', '2024-08-26 16:13:57'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 26, '0', 9999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19998, 0, '', '2024-08-26 16:15:30'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 27, '0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 200, 0, '', '2024-08-27 08:51:46'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 28, '0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 200, 0, '', '2024-08-27 10:40:56'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 29, '0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 200, 0, '', '2024-08-28 04:30:15'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 30, '0', 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 200, 0, '', '2024-08-28 04:31:31'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 31, '0', 100, 0, 0, 0, 0, 100, 0, 0, 0, 0, 0, 0, 400, 0, '', '2024-08-28 04:34:21'),
('Ue4234ef62c1283d8e1459a8273669d47', 'James JR', 'END', 32, '0', 400, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 800, 0, '', '2024-08-28 04:35:33');

-- --------------------------------------------------------

--
-- Table structure for table `user_data`
--

CREATE TABLE `user_data` (
  `Number` int(50) NOT NULL,
  `ID` varchar(50) NOT NULL,
  `Credit` double NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Status` varchar(30) NOT NULL,
  `Comment` text NOT NULL,
  `min1` varchar(11) NOT NULL,
  `max1` int(11) NOT NULL,
  `min2` int(11) NOT NULL,
  `max2` int(11) NOT NULL,
  `Date_begin` date NOT NULL DEFAULT current_timestamp(),
  `Active` date NOT NULL,
  `user_profile` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_data`
--

INSERT INTO `user_data` (`Number`, `ID`, `Credit`, `Name`, `Status`, `Comment`, `min1`, `max1`, `min2`, `max2`, `Date_begin`, `Active`, `user_profile`) VALUES
(1, 'admin', 1000000, 'AdminPokdeng', 'OK', '--', '0', 0, 0, 0, '2024-08-26', '0000-00-00', ''),
(2, 'admin2', 20, 'admin2', 'OK', 'รับ 5% ยอดได้จาก user 1', '0', 0, 0, 0, '2024-08-27', '0000-00-00', ''),
(0, 'U8aa0f0c0848fbbb2a3d1cd77adc4412c', 100000, 'NTPW', '1', '1', '10', 10000, 0, 0, '2024-08-25', '0000-00-00', 'https://sprofile.line-scdn.net/0hA9IK1y0OHhZkMjd2J'),
(3, 'Ue4234ef62c1283d8e1459a8273669d47', 999780, 'James JR', '1', '1', '100', 100000, 0, 0, '2024-08-25', '0000-00-00', 'https://sprofile.line-scdn.net/0hSdPbv_cPDEt9GxpdGPFyNA1LDyFealVZV3tLLEwYW3pDIxgZUXpKLhobUClJKxwcAigWf0tPBitxCHstY03wf3orUXpBLEoVUXpApA');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `adminlog`
--
ALTER TABLE `adminlog`
  ADD PRIMARY KEY (`N`);

--
-- Indexes for table `playinglog`
--
ALTER TABLE `playinglog`
  ADD KEY `round` (`round`);

--
-- Indexes for table `user_data`
--
ALTER TABLE `user_data`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `Number` (`Number`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `adminlog`
--
ALTER TABLE `adminlog`
  MODIFY `N` int(50) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=95;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
